/**************************************************************************************
实验现象：下载程序后，直流电机旋转大约5S，然后停止
		  
接线说明： (具体接线图可见开发攻略对应实验的“实验现象”章节)
		   1，单片机-->五线四相步进电机模块
		   		P10-P14-->IN1-IN4
		   2，五线四相步进电机模块输出-->步进电机
		   		5V-->步进电机红色电源线
	
	
注意事项：																				
  
***************************************************************************************/

#include "define.h"			 //此文件中定义了单片机的一些特殊功能寄存器
//#include <intrins.h>		//因为要用到左右移函数，所以加入这个头文件

sbit AD_P1_0 MOTO_A;
sbit AD_P1_1 MOTO_B;
sbit AD_P1_2 MOTO_C;
sbit AD_P1_3 MOTO_D;

#define SPEED	150	  	//时间过长电机抖动，时间过短电机不转

/*******************************************************************************
* 函 数 名         : delay
* 函数功能		   : 延时函数，i=1时，大约延时10us
*******************************************************************************/
void delay(u16 i)
{
    while(i--);
}


/*******************************************************************************
* 函 数 名       : main
* 函数功能		 : 主函数
* 输    入       : 无
* 输    出    	 : 无
*******************************************************************************/
void main()
{
    u8 i=0;

    while(1)
    {
        switch(i)
        {
            case 7: MOTO_A=1;MOTO_B=0;MOTO_C=0;MOTO_D=0;break;
            case 6: MOTO_A=1;MOTO_B=1;MOTO_C=0;MOTO_D=0;break;
            case 5: MOTO_A=0;MOTO_B=1;MOTO_C=0;MOTO_D=0;break;
            case 4: MOTO_A=0;MOTO_B=1;MOTO_C=1;MOTO_D=0;break;
            case 3: MOTO_A=0;MOTO_B=0;MOTO_C=1;MOTO_D=0;break;
            case 2: MOTO_A=0;MOTO_B=0;MOTO_C=1;MOTO_D=1;break;
            case 1: MOTO_A=0;MOTO_B=0;MOTO_C=0;MOTO_D=1;break;
            case 0: MOTO_A=1;MOTO_B=0;MOTO_C=0;MOTO_D=1;break;
        }
        i++;
        if(i==8)i=0;
        delay(SPEED);
    }
}
